In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["Abhinav", "Rahul", "Shivansh", "Display"],
    "marks" : [93, 4, 66, 33],
    "city" : ["Mumbai", "kalyan", "Madhubani", "Kolkata"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name  marks       city
0   Abhinav     93     Mumbai
1     Rahul      4     kalyan
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [5]:
df.to_csv("friends.csv")

In [6]:
df.to_csv("friends_indexFalse.csv", index=False)

In [7]:
df.head(2)

      name  marks    city
0  Abhinav     93  Mumbai
1    Rahul      4  kalyan

In [8]:
df.tail(2)

       name  marks       city
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [9]:
df.tail(10)

       name  marks       city
0   Abhinav     93     Mumbai
1     Rahul      4     kalyan
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [10]:
df.describe()

           marks
count   4.000000
mean   49.000000
std    38.755645
min     4.000000
25%    25.750000
50%    49.500000
75%    72.750000
max    93.000000

In [11]:
train = pd.read_csv("train.csv")

In [12]:
train["Speed"]

0    129
1    123
2    200
3     90
Name: Speed, dtype: int64

In [13]:
train["city"][0]

'Mumbai'

In [14]:
train['city'][3] = "Patna"

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_10268/3634185913.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['city'][3] = "Patna"

In [15]:
train.to_csv("train.csv", index=False)

In [16]:
train

   Tain no.  Speed    city
0    893009    129  Mumbai
1    239843    123   Delhi
2    234323    200    Kota
3    324234     90   Patna

In [17]:
train.index = ["First", "Second", "Third", "Fourth"]

In [18]:
train

        Tain no.  Speed    city
First     893009    129  Mumbai
Second    239843    123   Delhi
Third     234323    200    Kota
Fourth    324234     90   Patna

In [19]:
series = pd.Series(np.random.rand(20))

In [20]:
print(series, type(series))

0     0.389551
1     0.464562
2     0.314196
3     0.065303
4     0.927706
5     0.761123
6     0.153675
7     0.905277
8     0.572885
9     0.473414
10    0.516399
11    0.719608
12    0.811093
13    0.199164
14    0.693616
15    0.371869
16    0.501623
17    0.915097
18    0.936565
19    0.273384
dtype: float64 <class 'pandas.core.series.Series'>

In [21]:
new_df = pd.DataFrame(np.random.rand(445, 6), index=np.arange(445))

In [22]:
new_df.head()

          0         1         2         3         4         5
0  0.672593  0.720593  0.229848  0.943175  0.318788  0.010198
1  0.779419  0.660920  0.371192  0.798483  0.659956  0.564920
2  0.776192  0.518159  0.372383  0.610873  0.333960  0.310695
3  0.069751  0.642273  0.448926  0.439887  0.452061  0.295845
4  0.614095  0.661557  0.439641  0.226319  0.421335  0.656610

In [23]:
new_df.tail()

            0         1         2         3         4         5
440  0.928885  0.675048  0.409019  0.171578  0.392118  0.094019
441  0.803484  0.646637  0.813575  0.636847  0.336340  0.614684
442  0.978488  0.337068  0.738960  0.467986  0.870005  0.207932
443  0.233349  0.592034  0.913512  0.366084  0.201285  0.252730
444  0.851077  0.047634  0.207810  0.705175  0.993682  0.978176

In [24]:
new_df.describe()

                0           1           2           3           4           5
count  445.000000  445.000000  445.000000  445.000000  445.000000  445.000000
mean     0.495136    0.529976    0.509560    0.488018    0.508458    0.478757
std      0.291893    0.283557    0.279071    0.287623    0.291357    0.286165
min      0.003558    0.004843    0.001618    0.000284    0.000032    0.000141
25%      0.248837    0.287882    0.264376    0.233064    0.243082    0.239790
50%      0.481202    0.540698    0.506390    0.488075    0.512698    0.476652
75%      0.741220    0.777666    0.736169    0.733196    0.758648    0.720885
max      0.999495    0.999664    0.991820    0.992516    0.998464    0.999842

In [25]:
print(type(new_df))

<class 'pandas.core.frame.DataFrame'>

In [26]:
new_df[0][0] = "Abhinav"

In [27]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
5    float64
dtype: object

In [28]:
new_df.head()

          0         1         2         3         4         5
0   Abhinav  0.720593  0.229848  0.943175  0.318788  0.010198
1  0.779419  0.660920  0.371192  0.798483  0.659956  0.564920
2  0.776192  0.518159  0.372383  0.610873  0.333960  0.310695
3  0.069751  0.642273  0.448926  0.439887  0.452061  0.295845
4  0.614095  0.661557  0.439641  0.226319  0.421335  0.656610

In [29]:
new_df[0][0] = 0.5

In [30]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.720593  0.229848  0.943175  0.318788  0.010198
1  0.779419  0.660920  0.371192  0.798483  0.659956  0.564920
2  0.776192  0.518159  0.372383  0.610873  0.333960  0.310695
3  0.069751  0.642273  0.448926  0.439887  0.452061  0.295845
4  0.614095  0.661557  0.439641  0.226319  0.421335  0.656610

In [31]:
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,435,436,437,438,439,440,441,442,443,444
0,0.5,0.779419,0.776192,0.069751,0.614095,0.712655,0.211932,0.931227,0.571469,0.040855,...,0.493482,0.629831,0.23272,0.420046,0.850086,0.928885,0.803484,0.978488,0.233349,0.851077
1,0.720593,0.66092,0.518159,0.642273,0.661557,0.467356,0.710483,0.794049,0.505819,0.273856,...,0.135037,0.516409,0.54212,0.956777,0.405887,0.675048,0.646637,0.337068,0.592034,0.047634
2,0.229848,0.371192,0.372383,0.448926,0.439641,0.564197,0.904329,0.426892,0.702969,0.180237,...,0.545086,0.32884,0.864898,0.610908,0.370548,0.409019,0.813575,0.73896,0.913512,0.20781
3,0.943175,0.798483,0.610873,0.439887,0.226319,0.729624,0.012134,0.626881,0.090348,0.851493,...,0.568125,0.189952,0.846137,0.670923,0.625685,0.171578,0.636847,0.467986,0.366084,0.705175
4,0.318788,0.659956,0.33396,0.452061,0.421335,0.232394,0.49329,0.588678,0.491591,0.204301,...,0.087513,0.193155,0.452237,0.749609,0.631443,0.392118,0.33634,0.870005,0.201285,0.993682
5,0.010198,0.56492,0.310695,0.295845,0.65661,0.557623,0.148867,0.011703,0.984021,0.420298,...,0.095279,0.194591,0.248242,0.506289,0.257061,0.094019,0.614684,0.207932,0.25273,0.978176

In [32]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.720593  0.229848  0.943175  0.318788  0.010198
1  0.779419  0.660920  0.371192  0.798483  0.659956  0.564920
2  0.776192  0.518159  0.372383  0.610873  0.333960  0.310695
3  0.069751  0.642273  0.448926  0.439887  0.452061  0.295845
4  0.614095  0.661557  0.439641  0.226319  0.421335  0.656610

In [33]:
new_df.sort_index(axis=0, ascending=False)

            0         1         2         3         4         5
444  0.851077  0.047634  0.207810  0.705175  0.993682  0.978176
443  0.233349  0.592034  0.913512  0.366084  0.201285  0.252730
442  0.978488  0.337068  0.738960  0.467986  0.870005  0.207932
441  0.803484  0.646637  0.813575  0.636847  0.336340  0.614684
440  0.928885  0.675048  0.409019  0.171578  0.392118  0.094019
..        ...       ...       ...       ...       ...       ...
4    0.614095  0.661557  0.439641  0.226319  0.421335  0.656610
3    0.069751  0.642273  0.448926  0.439887  0.452061  0.295845
2    0.776192  0.518159  0.372383  0.610873  0.333960  0.310695
1    0.779419  0.660920  0.371192  0.798483  0.659956  0.564920
0         0.5  0.720593  0.229848  0.943175  0.318788  0.010198

[445 rows x 6 columns]

In [34]:
new_df.sort_index(axis=1, ascending=True)

            0         1         2         3         4         5
0         0.5  0.720593  0.229848  0.943175  0.318788  0.010198
1    0.779419  0.660920  0.371192  0.798483  0.659956  0.564920
2    0.776192  0.518159  0.372383  0.610873  0.333960  0.310695
3    0.069751  0.642273  0.448926  0.439887  0.452061  0.295845
4    0.614095  0.661557  0.439641  0.226319  0.421335  0.656610
..        ...       ...       ...       ...       ...       ...
440  0.928885  0.675048  0.409019  0.171578  0.392118  0.094019
441  0.803484  0.646637  0.813575  0.636847  0.336340  0.614684
442  0.978488  0.337068  0.738960  0.467986  0.870005  0.207932
443  0.233349  0.592034  0.913512  0.366084  0.201285  0.252730
444  0.851077  0.047634  0.207810  0.705175  0.993682  0.978176

[445 rows x 6 columns]

In [35]:
type(new_df[0])

pandas.core.series.Series

In [36]:
new_df2 = new_df.copy()

In [37]:
new_df2[0][0] = 983
new_df2.head()

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_10268/250112503.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df2[0][0] = 983

          0         1         2         3         4         5
0       983  0.720593  0.229848  0.943175  0.318788  0.010198
1  0.779419  0.660920  0.371192  0.798483  0.659956  0.564920
2  0.776192  0.518159  0.372383  0.610873  0.333960  0.310695
3  0.069751  0.642273  0.448926  0.439887  0.452061  0.295845
4  0.614095  0.661557  0.439641  0.226319  0.421335  0.656610

In [38]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.720593  0.229848  0.943175  0.318788  0.010198
1  0.779419  0.660920  0.371192  0.798483  0.659956  0.564920
2  0.776192  0.518159  0.372383  0.610873  0.333960  0.310695
3  0.069751  0.642273  0.448926  0.439887  0.452061  0.295845
4  0.614095  0.661557  0.439641  0.226319  0.421335  0.656610

In [39]:
#new_df.loc[0, "A"] = 556  #no warning

In [40]:
new_df.head(2)

          0         1         2         3         4         5
0       0.5  0.720593  0.229848  0.943175  0.318788  0.010198
1  0.779419  0.660920  0.371192  0.798483  0.659956  0.564920

In [41]:
new_df.columns = list("ABCDEF")

In [42]:
new_df

            A         B         C         D         E         F
0         0.5  0.720593  0.229848  0.943175  0.318788  0.010198
1    0.779419  0.660920  0.371192  0.798483  0.659956  0.564920
2    0.776192  0.518159  0.372383  0.610873  0.333960  0.310695
3    0.069751  0.642273  0.448926  0.439887  0.452061  0.295845
4    0.614095  0.661557  0.439641  0.226319  0.421335  0.656610
..        ...       ...       ...       ...       ...       ...
440  0.928885  0.675048  0.409019  0.171578  0.392118  0.094019
441  0.803484  0.646637  0.813575  0.636847  0.336340  0.614684
442  0.978488  0.337068  0.738960  0.467986  0.870005  0.207932
443  0.233349  0.592034  0.913512  0.366084  0.201285  0.252730
444  0.851077  0.047634  0.207810  0.705175  0.993682  0.978176

[445 rows x 6 columns]

In [43]:
new_df = new_df.drop("F", axis=1)

In [44]:
new_df.head()

          A         B         C         D         E
0       0.5  0.720593  0.229848  0.943175  0.318788
1  0.779419  0.660920  0.371192  0.798483  0.659956
2  0.776192  0.518159  0.372383  0.610873  0.333960
3  0.069751  0.642273  0.448926  0.439887  0.452061
4  0.614095  0.661557  0.439641  0.226319  0.421335

In [45]:
new_df.loc[[1, 2], ["C", "D"]]
new_df.loc[[1, 2], :]
new_df.loc[:, ["C", "D"]]

            C         D
0    0.229848  0.943175
1    0.371192  0.798483
2    0.372383  0.610873
3    0.448926  0.439887
4    0.439641  0.226319
..        ...       ...
440  0.409019  0.171578
441  0.813575  0.636847
442  0.738960  0.467986
443  0.913512  0.366084
444  0.207810  0.705175

[445 rows x 2 columns]

# Try to Run Complex quearies in data frames

In [46]:
new_df.loc[new_df["A"] < 0.2]
new_df.loc[(new_df["B"] < 0.3) & (new_df["C"] > 0.1)]

            A         B         C         D         E
9    0.040855  0.273856  0.180237  0.851493  0.204301
13   0.957644  0.132155  0.129737  0.750555  0.596327
24   0.246957  0.221722  0.765628  0.178659  0.199585
42   0.443991  0.253384  0.238977  0.523942  0.060199
46   0.743358  0.275728  0.214212  0.534290  0.374730
..        ...       ...       ...       ...       ...
428  0.372507  0.032938  0.707349  0.486530  0.601350
429  0.698021  0.059793  0.555537  0.344982  0.186455
433  0.092068  0.096718  0.777001  0.254574  0.647955
435  0.493482  0.135037  0.545086  0.568125  0.087513
444  0.851077  0.047634  0.207810  0.705175  0.993682

[109 rows x 5 columns]

In [47]:
new_df.loc[new_df["E"] > 0.9]

            A         B         C         D         E
10   0.681588  0.499397  0.152722  0.471478  0.924717
21   0.343332  0.443409  0.785196  0.135900  0.910710
28    0.01658  0.993283  0.167808  0.091530  0.960134
29   0.737135  0.591332  0.559617  0.272660  0.933122
39    0.03276  0.332515  0.512031  0.889453  0.955566
45   0.009703  0.452762  0.007590  0.928808  0.921391
65   0.110666  0.425363  0.066752  0.127327  0.968007
72   0.268323  0.393943  0.249653  0.570487  0.914427
97   0.489645  0.977229  0.892645  0.763495  0.912758
98   0.710547  0.912575  0.298589  0.811830  0.991814
101  0.325847  0.382286  0.744492  0.126477  0.942377
110  0.875554  0.631449  0.772120  0.370666  0.934956
115  0.321509  0.478883  0.697057  0.623471  0.986954
119  0.164287  0.984243  0.905738  0.851507  0.971432
121  0.426322  0.440922  0.039934  0.453624  0.956231
126  0.153682  0.023856  0.492301  0.805639  0.956074
133  0.714524  0.455598  0.351598  0.316575  0.911576
139  0.738167  0.457561  0.390486  0.227772  0.978804
151  0.811555  0.737929  0.261417  0.341762  0.903638
154  0.899438  0.788348  0.614742  0.885284  0.958616
155  0.685495  0.421778  0.424742  0.943589  0.952862
156  0.337473  0.240998  0.983839  0.693565  0.958355
179  0.393557  0.652180  0.142561  0.168765  0.955477
194  0.572303  0.568791  0.662204  0.002988  0.983751
210  0.916401  0.986740  0.154215  0.697084  0.933369
218  0.910883  0.358827  0.626516  0.793426  0.995806
225  0.366881  0.700983  0.378182  0.388038  0.953841
226  0.414465  0.697920  0.892631  0.075200  0.958512
261  0.294051  0.540698  0.209737  0.503665  0.915438
265  0.783786  0.711037  0.702679  0.396472  0.919866
273  0.457992  0.754896  0.722517  0.836621  0.927143
276  0.910949  0.492229  0.149629  0.550648  0.959799
289  0.412563  0.582381  0.431249  0.778098  0.912849
308  0.285184  0.920638  0.685536  0.858405  0.947932
314  0.921819  0.149694  0.840268  0.387291  0.970713
317  0.685527  0.539891  0.182484  0.694501  0.913112
335   0.62126  0.004843  0.475036  0.823994  0.959008
341  0.089329  0.346305  0.805040  0.898541  0.933634
344  0.499821  0.713753  0.131501  0.523630  0.937893
374  0.180059  0.603471  0.731718  0.124888  0.984912
377   0.53478  0.018922  0.813328  0.794910  0.908678
396  0.051372  0.801945  0.669143  0.122654  0.994176
400  0.752986  0.515325  0.569249  0.254462  0.973260
403  0.546062  0.159708  0.811388  0.992516  0.998464
405  0.307207  0.460174  0.618103  0.576826  0.921053
412  0.230631  0.092738  0.570360  0.289866  0.970544
444  0.851077  0.047634  0.207810  0.705175  0.993682

In [48]:
new_df.loc[:]

            A         B         C         D         E
0         0.5  0.720593  0.229848  0.943175  0.318788
1    0.779419  0.660920  0.371192  0.798483  0.659956
2    0.776192  0.518159  0.372383  0.610873  0.333960
3    0.069751  0.642273  0.448926  0.439887  0.452061
4    0.614095  0.661557  0.439641  0.226319  0.421335
..        ...       ...       ...       ...       ...
440  0.928885  0.675048  0.409019  0.171578  0.392118
441  0.803484  0.646637  0.813575  0.636847  0.336340
442  0.978488  0.337068  0.738960  0.467986  0.870005
443  0.233349  0.592034  0.913512  0.366084  0.201285
444  0.851077  0.047634  0.207810  0.705175  0.993682

[445 rows x 5 columns]

In [49]:
new_df.loc[10, "A"] = 108
new_df.dtypes

A     object
B    float64
C    float64
D    float64
E    float64
dtype: object

In [50]:
new_df.head(3)

          A         B         C         D         E
0       0.5  0.720593  0.229848  0.943175  0.318788
1  0.779419  0.660920  0.371192  0.798483  0.659956
2  0.776192  0.518159  0.372383  0.610873  0.333960

In [51]:
print(new_df.iloc[0, 2])   # work with just index no need of ccolumns and rows name
print(new_df.iloc[:, 2])

0.22984839946884994
0      0.229848
1      0.371192
2      0.372383
3      0.448926
4      0.439641
         ...
440    0.409019
441    0.813575
442    0.738960
443    0.913512
444    0.207810
Name: C, Length: 445, dtype: float64

In [52]:
new_df.iloc[[0, 3], [1, 4, 3]]

          B         E         D
0  0.720593  0.318788  0.943175
3  0.642273  0.452061  0.439887

In [53]:
new_df.iloc[0, 3] = 6
new_df.iloc[0, 3]

6.0

In [54]:
new_df.drop({"A", "C"}, axis=1)

            B         D         E
0    0.720593  6.000000  0.318788
1    0.660920  0.798483  0.659956
2    0.518159  0.610873  0.333960
3    0.642273  0.439887  0.452061
4    0.661557  0.226319  0.421335
..        ...       ...       ...
440  0.675048  0.171578  0.392118
441  0.646637  0.636847  0.336340
442  0.337068  0.467986  0.870005
443  0.592034  0.366084  0.201285
444  0.047634  0.705175  0.993682

[445 rows x 3 columns]

In [55]:
new_df.drop({4, 440, 444}, axis=0, inplace=True)

In [56]:
new_df

            A         B         C         D         E
0         0.5  0.720593  0.229848  6.000000  0.318788
1    0.779419  0.660920  0.371192  0.798483  0.659956
2    0.776192  0.518159  0.372383  0.610873  0.333960
3    0.069751  0.642273  0.448926  0.439887  0.452061
5    0.712655  0.467356  0.564197  0.729624  0.232394
..        ...       ...       ...       ...       ...
438  0.420046  0.956777  0.610908  0.670923  0.749609
439  0.850086  0.405887  0.370548  0.625685  0.631443
441  0.803484  0.646637  0.813575  0.636847  0.336340
442  0.978488  0.337068  0.738960  0.467986  0.870005
443  0.233349  0.592034  0.913512  0.366084  0.201285

[442 rows x 5 columns]

In [57]:
new_df.reset_index(drop=True, inplace=True)

In [58]:
new_df

            A         B         C         D         E
0         0.5  0.720593  0.229848  6.000000  0.318788
1    0.779419  0.660920  0.371192  0.798483  0.659956
2    0.776192  0.518159  0.372383  0.610873  0.333960
3    0.069751  0.642273  0.448926  0.439887  0.452061
4    0.712655  0.467356  0.564197  0.729624  0.232394
..        ...       ...       ...       ...       ...
437  0.420046  0.956777  0.610908  0.670923  0.749609
438  0.850086  0.405887  0.370548  0.625685  0.631443
439  0.803484  0.646637  0.813575  0.636847  0.336340
440  0.978488  0.337068  0.738960  0.467986  0.870005
441  0.233349  0.592034  0.913512  0.366084  0.201285

[442 rows x 5 columns]

In [59]:
new_data = {
    'A' : [None, None, 4, 6, 7, 9],
    'B' : [0, 3, 5, 7, None, 8],
    'C' : [5, None, 4, 56, 6, 90],
    'D' : [239, 234, None, 0, 0, 23]
    
}
new_data = pd.DataFrame(new_data)

In [60]:
new_data

     A    B     C      D
0  NaN  0.0   5.0  239.0
1  NaN  3.0   NaN  234.0
2  4.0  5.0   4.0    NaN
3  6.0  7.0  56.0    0.0
4  7.0  NaN   6.0    0.0
5  9.0  8.0  90.0   23.0

In [61]:
new_data.dropna()

     A    B     C     D
3  6.0  7.0  56.0   0.0
5  9.0  8.0  90.0  23.0

In [62]:
new_data.columns = ["K", "L", "M", "N"]

In [63]:
new_data

     K    L     M      N
0  NaN  0.0   5.0  239.0
1  NaN  3.0   NaN  234.0
2  4.0  5.0   4.0    NaN
3  6.0  7.0  56.0    0.0
4  7.0  NaN   6.0    0.0
5  9.0  8.0  90.0   23.0

In [64]:
new_data.rename(index={_:__ for _, __ in enumerate("GAUTAM")})

     K    L     M      N
G  NaN  0.0   5.0  239.0
A  NaN  3.0   NaN  234.0
U  4.0  5.0   4.0    NaN
T  6.0  7.0  56.0    0.0
A  7.0  NaN   6.0    0.0
M  9.0  8.0  90.0   23.0

In [65]:
new_data.drop_duplicates(subset=new_data.columns)

     K    L     M      N
0  NaN  0.0   5.0  239.0
1  NaN  3.0   NaN  234.0
2  4.0  5.0   4.0    NaN
3  6.0  7.0  56.0    0.0
4  7.0  NaN   6.0    0.0
5  9.0  8.0  90.0   23.0

In [66]:
new_data.isnull()
new_data["K"].isnull()

0     True
1     True
2    False
3    False
4    False
5    False
Name: K, dtype: bool

In [67]:
new_data.drop([0, 5], axis=0)

     K    L     M      N
1  NaN  3.0   NaN  234.0
2  4.0  5.0   4.0    NaN
3  6.0  7.0  56.0    0.0
4  7.0  NaN   6.0    0.0

In [68]:
new_df["B"] = 0
new_df["B"] == 0

0      True
1      True
2      True
3      True
4      True
       ...
437    True
438    True
439    True
440    True
441    True
Name: B, Length: 442, dtype: bool

In [69]:
new_df.loc[:, ["B"]] = None
new_df.loc[:, ["B"]].isnull().head()

      B
0  True
1  True
2  True
3  True
4  True

In [70]:
new_df.loc[:, ["C"]].describe()

                C
count  442.000000
mean     0.510629
std      0.279587
min      0.001618
25%      0.264550
50%      0.513432
75%      0.736402
max      0.991820

In [71]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [72]:
df.dropna()
df.dropna(how="any", axis=1)

     name
0  Alfred
1  Batman
2  Alfred

In [73]:
df.drop_duplicates(subset=["name"], keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [74]:
df.shape
new_data.shape
new_df.shape

(442, 5)

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [76]:
df.loc[:, ["name"]].value_counts()

name
Alfred    2
Batman    1
dtype: int64

In [77]:
df.loc[[0, 1], ["name", "toy"]].value_counts(dropna=False)

name    toy
Alfred  NaN          1
Batman  Batmobile    1
dtype: int64

In [78]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [79]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

# Read Exel Sheets in Pandas